OpenFOAM-v2112/tutorials/incompressible/simpleFoam/bump2D/setups.orig/common/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-08;
        relTol          0.1;
    }

    "(U|k|epsilon|omega|nuTilda|phit)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }

    f
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent          yes;
    residualControl
    {
        p               1e-5;
        U               1e-5;
        "(k|epsilon|omega|nuTilda|phit|f)" 1e-5;
    }
}

relaxationFactors
{
    equations
    {
        U               0.9;
        "(k|epsilon|omega|nuTilda|phit|f)" 0.7;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
